//Сценарії
const planetname = document.getElementById('planet');

function colonySelect() {
    mentalityInPlay['Допитливість'] = {desc: 'Базис людської натури',
        effect: {temper: {'Мислитель': 50, 'Розвідник': 20}, exploringMult: 2, joinGlobalMarket: true}};
    
    mentalityInPlay['Гарт'] = {desc: 'Цей народ потребує лише мінімум для виживання і за потреби готовий жити без благ. Одиниця населення цієї нації виробляє одиницю праці та споживає одиницю їжі, води та житла',
        effect: {resoursePerPop: {'Їжа': -1, 'Вода': -1, 'Житло': -1, 'Праця': 1}, supportLaw: {'Стратократія': 10, 'Міжнародна організація': -10}, temper: {'Офіцер': 25, 'Витязь': 15, 'Розвідник': 5}}};
    
    createNO('Колоністи', '#93006c', '🔭', 'Колоністи з Неомонархії, які заселили і бажають експлуатувати нову планету', ['Допитливість', 'Гарт'], 20, 30);

    displayPNM();
    planetname.innerHTML = 'Колонія NMY';
    logger('Обрано початок у колонії NMY', 'success-message');
};

createCO('select-planet', 'Консоль', [
    { name: 'Запуск сценарію NMY', aliases: ['1', 'NMY', 'select 1', 'select NMY'], fn: colonySelect,},
    { name: 'Допомога', aliases: ['help', '?'], fn: helpActive},
]);

//Нації
function nationCOpop() {
    if (!activeNO) {
        let total = 0;
        for (let n of Object.values(nationObjects)) {
            total += n.pop
        };
        logger(`Всього на планеті проживає ${total} одиниць населення`, 'success-message');
    } else {
        let n = activeNO;
        logger(`Чисельність нації <span style="color:${n.color};">"${n.name}"</span> складає ${n.pop} одиниць населення`, 'success-message')
    }
};

function nationCOland() {
    if (!activeNO) {
        let total = 0;
        for (let n of Object.values(nationObjects)) {
            total += n.land
        };
        logger(`На планеті привласнено ${total} одиниць придатної площі`, 'success-message');
    } else {
        let n = activeNO;
        logger(`Нації <span style="color:${n.color};">"${n.name}"</span> належить ${n.land} одиниць придатної площі`, 'success-message')
    }
};

function nationCOmentality() {
    if (!activeNO) {logger('Обери націю для перегляду її менталітету', 'error-message')}
    else {
        let n = activeNO;
        let str = '';
        logger(`Менталітет нації <span style="color:${n.color};">"${n.name}"</span>`, 'success-message');
        for (let m of n.mentality) {str += `${m}: ` + mentalityInPlay[m].desc + `<br>`, 'item'};
        logger(str, 'item');
    }
};



createCO('nation', 'Консоль: нації', [
    { name: 'Перегляд менталітету', aliases: ['m', 'mental', `mentality`], fn: nationCOmentality},
    { name: 'Перегляд населення', aliases: ['pop', 'population'], fn: nationCOpop},
    { name: 'Перегляд земель', aliases: ['land'], fn: nationCOland},
    { name: 'Статистика планети', aliases: ['p', 'planet'], fn: () => {activeNO = null; logger('Статистика тепер буде про всю планету', 'success-message')}},
    { name: 'Меню економіки', aliases: ['economy', 'e'], fn: () => logger('Ніц поки не робиться', 'error-message')},
    { name: 'Допомога', aliases: ['help', 'h', '?'], fn: helpActive},
]);

//Старт гри
activateCO('select-planet');
logger('Ви запустили Неомонархію. Оберіть один з доступних сценаріїв', 'item');
logger('1. <b>Колонія NMY</b>. Після тривалої гібернації на колонізаторському човні, група поселенців з Неомонархії почала розроблювати землі нової планети під строгим управлінням Намісника Неомонархії. Тобі вирішувати, чи віддалена земля перевинайде для себе демократію, чи залишить режим заради економічного процвітання, чи будь-який інший спосіб утворення її майбутнього)', 'nmy-message')
