const planetname = document.getElementById('planet');

function colonySelect() {
    createNO('Колоністи', '#93006c', '🔭', 'Колоністи з Неомонархії, які заселили і бажають експлуатувати нову планету', [], 20, 30);
    displayPNM();
    planetname.innerHTML = 'Колонія NMY';
    logger('Обрано початок у колонії NMY', 'success-message');
};



createCO('select-planet', 'Консоль', [
    { name: 'Запуск сценарію NMY', aliases: ['1', 'NMY', 'select 1', 'select NMY'], fn: colonySelect,},
    { name: 'Допомога', aliases: ['help', '?'], fn: helpActive},
]);

createCO('planet-nation', 'Консоль: нації', [
    { name: 'Перегляд ринків', aliases: ['markets', 'm'], fn: () => logger('Ніц поки не робиться', 'error-message')},
    { name: 'Допомога', aliases: ['help', 'h', '?'], fn: helpActive},
]);


activateCO('select-planet');
logger('Ви запустили Неомонархію. Оберіть один з доступних сценаріїв', 'item');
logger('1. <b>Колонія NMY</b>. Після тривалої гібернації на колонізаторському човні, група поселенців з Неомонархії почала розроблювати землі нової планети під строгим управлінням Намісника Неомонархії. Тобі вирішувати, чи віддалена земля перевинайде для себе демократію, чи залишить режим заради економічного процвітання, чи будь-який інший спосіб утворення її майбутнього)', 'nmy-message')
